[
  {
    "title": "Visiting Professor - Computer Science",
    "company": "Saint Louis University",
    "location": "St. Louis",
    "description": "Saint Louis University, a Catholic, Jesuit institution committed to student learning, research, health care, and service, invites applications for a one-year Visiting Professor position in Computer Science, beginning in August 2025. Rank is open and will be commensurate with experience. The visiting faculty member will primarily focus on delivering high-qualityinstruction across a diverse portfolio of inclusive undergraduate and graduate courses. Candidates with expertise in Computer Science or a closely related field are invited to apply. A doctoral degree is preferred but not required. For more information, please email cs slu.edu and applications and more information can be found at https tinyurl.com nuyuh6mx. Applications will be accepted until the position is filled. Saint Louis University is an Equal Employment Opportunity Employer."
  },
  {
    "title": "Part Time Evaluator, Software Engineering and Computer Science",
    "company": "Western Governors University",
    "location": "St. Louis",
    "description": "If you re passionate about building a better future for individuals, communities, and our country and you re committed to working hard to play your part in building that future consider WGU as the next step in your career. Driven by a mission to expand access to higher education through online, competency-based degree programs, WGU is also committed to being a great place to work for a diverse workforce of student-focused professionals. The university has pioneered a new way to learn in the 21st century, one that has received praise from academic, industry, government, and media leaders. Whatever your role, working for WGU gives you a part to play in helping students graduate, creating a better tomorrow for themselves and their families. The salary range for this position takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets  experience and training  licensure and certifications  and other business and organizational needs. At WGU, it is not typical for an individual to be hired at or near the top of the range for their position, and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is Grade  Faculty 504 Pay Range  $27.21 - $40.81 Job Description Essential Functions and Responsibilities  Analyze and evaluate assessments to determine students  mastery of learning objectives and course competencies.  Prepare accurate, helpful, and consistent feedback to help students develop course competencies.  Apply evaluation processes, policies, and procedures when reviewing and determining students  mastery of course learning objectives and program competencies.  Stay current with updates to evaluation processes  adopt and apply updated and new evaluation processes as they occur.  Collaborate with team members and leadership when evaluating new and complex assessments to ensure consistent evaluation ratings.  Review evaluation feedback from team members and leaders, apply input as needed to ensure evaluation methods align with department and team expectations.  Partner with team members and leaders to improve evaluation processes that promote consistent scoring and improve evaluation processes. Knowledge, Skill, and Abilities  Ability to review students  responses on assessments and determine mastery of learning objectives and course competencies.  Ability to evaluate assessments and develop accurate, helpful, personalized, and consistent feedback to students in a way that helps them progress through their academic programs.  Ability to maintain expertise in content relevant to the role.  Demonstrate excellent communication skills (verbal and written).  Demonstrated competency with technology needed to evaluate and respond to students  assessments.  Ability to adapt quickly to new processes and apply changes to evaluation processes.  Ability to provide and receive constructive feedback and ensure consistency in evaluation responses.  Demonstrated attention to detail and accuracy.  Demonstrated ability to collaborate and work effectively as part of a team.  Ability to work independently to complete assessment evaluations consistent with standard practices and policies. Job Qualifications Minimum Qualifications  Minimum earned master s degree in science, IT related  Minimum 3 years  experience in Computer Science Software Engineering or related  Experience with DevOps CI CD (Jenkins, GitLab CI, Octopus Deploy, Artifactory)  Experience with Kubernetes (control plane, data plane, nodes, container runtime, and kubectl)  Familiarity with containerization technologies (Docker) and cloud platforms (AWS, Azure, or GCP).  An understanding of Infrastructure as Code (IaC), and configuration management tools (Terraform).  Experience with monitoring and logging tools (ELK, Prometheus, Grafana) and security monitoring tools (Wiz, Snyk) is a plus Additional Requirements  Work schedule will be determined by student and team needs and may include evenings, weekends, and holidays. Physical Requirements  Prolonged periods sitting at a desk and working on a computer. Position   Application Details Part-time Regular Positions (classified as regular and working less than 30 standard weekly hours)  This is a part-time, regular position (classified for less than 30 SWH) that is eligible for vision and mental healthcare  flexible spending account  voluntary life insurance  accident, critical illness and hospital indemnity supplemental coverages  legal and identity theft coverage  retirement savings plan  wellbeing program  discounted WGU tuition  and prorated paid holidays and accrued sick time. How to Apply  If interested, an application will need to be submitted online. Internal WGU employees will need to apply through the internal job board in Workday. Additional Information Disclaimer  The job posting highlights the most critical responsibilities and requirements of the job. It s not all-inclusive. Accommodations  Applicants with disabilities who require assistance or accommodation during the application or interview process should contact our Talent Acquisition team at recruiting wgu.edu. Equal Employment Opportunity  All qualified applicants will receive consideration for employment without regard to any protected characteristic as required by law."
  },
  {
    "title": "Faculty - Computer Information Technology / Software Developer",
    "company": "St. Louis Community College",
    "location": "St. Louis",
    "description": "Title  Faculty - Computer Information Technology   Software Developer Employee Classification  Faculty F T Department  Information Systems Salary Range  Commensurate with Experience Who We Are We are not-for-profit  St. Louis Community college (STLCC) is a non-profit institution dedicated to empowering students, expanding minds, and changing lives. Employees are committed to strengthening the St. Louis community with inclusive and transformative education. We are a respected employer  For 60 years, STLCC has served the St. Louis community, expanding to 4 main campuses, 2 education centers, 2 workforce training centers, and 5 centers of excellence. More than one-half of the households in St. Louis have at least one member who has taken classes at STLCC. We make an impact in the community  Through credit courses, continuing education, and workforce development programs, STLCC annually serves nearly 69,000 students. More than 80% of career and technical graduates employed in their fields or continue their education at four-year institutions within six months of graduation. STLCC sends more transfer students to Missouri s four-year colleges universities than anyone else. What You Get Benefits package  for full-time employees  STLCC offers one of the best benefit packages in the St. Louis area. As a STLCC employee you will have access to a 100% match on your contribution to retirement, two health insurance plans options - including an HSA option, low-cost life insurance with a 3x salary benefit, and other low-cost benefits including dental, vision, AD D, Short-term   Long-term disability insurance. Opportunity to grow  Over half of our employees have served the college for more than 12 years, exploring different career paths and advancing to higher level positions. Education   training opportunities  STLCC offers tuition waivers for employees  full-time and part-time    their dependents. Full-time employees can take advantage of tuition reimbursement for other institutions after just 6 months of service, and an annual professional development allotment. Work life balance  Full-time STLCC employees have access to a generous time off package, including holidays, vacation, personal days, medical leave, and other leave options. Our holiday schedule even includes a paid winter holiday at the end of the calendar year. Commitment to wellness  STLCC HR boasts a dedicated health and wellness specialist who is enthusiastic about creating a culture of wellness throughout the College. With access to college wellness vendors, employees are educated, motivated, and rewarded for healthy behaviors. STLCC employees and anyone living in their household also have access to an employee assistance program (EAP) that can help them with virtually any life need. The Basics Of This Position  This is an onsite position located in the St. Louis, Missouri area. Candidates should apply only if they are able to be physically present and available to work onsite by the start date.  Teach a wide range of courses in the Computer and Information Technology Programs, such as Computer Programming (C , C , Java, Python, etc), Database, Scripting, Web Development, Version Control, Computer Literacy, Computer Application (MS Office, Project Management), and Software and Hardware Architecture. There is a potential to teach a wide range of courses in Information Technology programs such as Unix Linux, Hardware and Software, Cisco Networking Academy including VoIP and firewalls, Microsoft Server, VMware, Cloud, AI, or Cybersecurity classes. Assists in maintaining instructional equipment, helps develop curriculum, and participates in department and college committees. Industry recognized certifications required to teach some courses. Teaching schedules vary between day, evening, and or weekends. May assume a departmental leadership role. What You ll Do  Full-time Faculty duties and responsibilities normally include  Formal course contact teaching hours.  Preparation and planning for instructing assigned classes in accordance with course objectives.  Preparing and correcting examinations and other student work assignments.  Scheduling student conferences to review individual student progress.  Assistance in student academic advisement.  Participation in departmental selection of course texts, instructional equipment, library books and non-print resource materials.  Participation in departmental development, evaluation and revision of course objectives and outlines, instructional strategies, and systems of evaluation of student learning. Education, Experience, And Other Requirements Bachelor s degree with a major in subject field and two (2) years of full-time college teaching experience, and one (1) year of related full-time work experience or Bachelor s degree with a major in subject field and four (4) years of full-time related work experience. Preferred Qualifications Master s degree in the subject field or a master s degree with at least thirty (30) approved graduate semester hours in the subject field and related fields. Five (5) years of full-time related work experience and prefer Industry certification(s) related to courses assigned. Community College teaching experience and demonstrated ability to work effectively with students, faculty and staff of diverse socioeconomic, cultural and racial ethnic backgrounds, as well as diverse abilities disabilities and sexual preferences."
  },
  {
    "title": "Adjunct Computer Science with AI",
    "company": "Webster University",
    "location": "St. Louis",
    "description": "Description The Department of Computer   Information Sciences at Webster University in St. Louis, Missouri, is recruiting adjunct faculty to teach computer science courses. The candidate should have either an undergraduate or graduate degree in the discipline of Computer Science (regardless of field of specialization). However, instructors with a minimum of eighteen graduate hours in (graduate level) Computer Science with a demonstrable understanding of the course content will be considered. Preference given to professionals in the field of Computer Science, Software Engineering, or Information Technology with a background and or research in Artificial Intelligence. Location Webster Groves Campus-WEBG Minimum Qualifications The Department of Math   Computer Science at Webster University in St. Louis, Missouri, is recruiting adjunct faculty to teach computer science courses related to Artificial Intelligence and Machine Language. The candidate should have either an undergraduate or graduate degree in the discipline of Computer Science (regardless of field of specialization). However, instructors with a minimum of eighteen graduate hours in (graduate level) Computer Science with Artificial Intelligence Machine Learning with a demonstrable understanding of the course content will be considered. Preference given to professionals in the field of Computer Science, Software Engineering, Artificial Intelligence, or Information Technology. Preferred Qualifications Candidates should have experience teaching programming, database, operating systems, and artificial intelligence machine learning Department Computer and Info Sciences-CAIS Special Instructions For Applicant Required Documents 1. Cover Letter-Letter of Interest 2. Curriculum Vitae Optional Documents 1. Transcripts 2. Evidence of Teaching Effectiveness 3. Letter(s) of Recommendation Physical Demands Adjunct faculty teach one to three courses per semester on-site. Graduate level courses typically meet one evening per week for nine weeks from 5 30pm-9 30pm. To apply, visit https recruiting.adp.com srccar public RTI.home?r 5001100899806 c 1180715 d ExternalCareerSite rb jobelephant jeid-158abe44479b924e98010d8567a7ddbb"
  },
  {
    "title": "AI Solutions Engineer - Customer-Facing Jobs",
    "company": "LaunchCode",
    "location": "St. Louis",
    "description": "Launchcode is recruiting for a rapidly growing and innovative AI company! This role is with one of our esteemed company partners and offers a chance to work at the forefront of technology. If you re passionate about AI and eager to be part of a cutting-edge team, this is your moment! Locations  On-site in St. Louis Apply now and launch your career in AI innovation! The perfect candidate is a versatile software engineer who thrives on direct client interaction, adeptly transforming unclear requirements and challenges into well-defined, sustainable solutions through close collaboration with Product and Engineering teams. This role sits at the crossroads of customer delivery, product development, and engineering, offering a wide range of experiences and allowing you to engage both your analytical and creative skills. Responsibilities Implement end-to-end data integrations, syncing customer data to the platform and back Collaborate with customer engineering teams to optimize data pipelines, including contributions to the design of API endpoints and input output schemas Design, develop, and maintain playbooks, internal tools, documentation, and SDKs to ensure customers are equipped for long-term success Work with engineers and operations to address any technical challenges customers may face, resolving technical issues that affect service delivery Take responsibility for the technical experience of customers throughout their engagement. Collaborate with account executives and product managers to identify specific customer feature requests Gain technical expertise in areas such as Large Language Models, 2D Image Annotation, and API integrations Promote the technology and engage with customers at major events Candidate must have TS or higher security clearance Experience working with clients in a technical, hands-on role Experience developing with Python and JavaScript, or other software languages Strong engineering background, preferably in Computer Science Strong project management and interpersonal skills Presentation skills with a high degree of technical credibility when speaking with a variety of stakeholders Communicates effectively across internal and external organizations Curious, empathetic, and can operate with high velocity Experience with AI and LLM Application Process Resume submission Behavioral interview screening with LaunchCode HackerRank assessment with LaunchCode Behavioral interview with company Technical interviews with company Behavioral interview with leadership"
  },
  {
    "title": "Temporary - Visiting Professor in Computer Science",
    "company": "Saint Louis University",
    "location": "St. Louis",
    "description": "Saint Louis University, a Catholic, Jesuit institution committed to student learning, research, health care, and service, invites applications for a one-year Visiting Professor position in Computer Science, beginning in August 2025. Rank is open and will be commensurate with experience. The visiting faculty member will primarily focus on delivering high-quality instruction across a diverse portfolio of inclusive undergraduate and graduate courses. While visiting faculty are valued members of the department with a teaching specialization, research engagement is encouraged but not required. Candidates with expertise in Computer Science or a closely related field are invited to apply. A doctoral degree is preferred but not required. We welcome applications from candidates across all areas of Computer Science, with particular interest in those specializing in object-oriented programming, software engineering, databases, computer systems, artificial intelligence, and machine learning. Additionally, we seek to strengthen existing departmental research and teaching areas, including algorithms, bioinformatics, computer vision, human-computer interaction, machine learning, computer graphics and VR, cyber-physical systems, computer networking, and cybersecurity. Required materials include a cover letter, CV, contact information for at least three references, a teaching statement, and a statement outlining how the applicants efforts contribute to an inclusive and diverse academic community. Review of applications will begin immediately and continue until the position is filled. For inquiries, please contact us at cs slu.edu."
  },
  {
    "title": "Assistant Professor of Computer Science Artificial Intelligence",
    "company": "Webster University",
    "location": "St. Louis",
    "description": "Assistant Professor of Computer Science Artificial Intelligence Description Webster University in St. Louis, Missouri, is seeking an experienced and motivated Assistant or Associate Professor to teach a graduate-level course in Computer Science Artificial Intelligence. The successful candidate will be expected to teach a wide range of Computer Science, Artificial Intelligence and or Machine Learning courses at the undergraduate and graduate level. Location Webster Groves Campus-WEBG Minimum Qualifications  Candidates must possess a Ph.D. in Computer Science or directly related fields and a specialty in Artificial Intelligence Machine Learning or related fields  Strong communication and presentation skills  A commitment to student success and the ability to motivate and inspire students to learn.  All academic degrees earned in the U.S. shall have been awarded by regionally accredited institutions, and faculty shall provide documentation thereof. For faculty whose degrees are earned abroad, official transcripts must be submitted to and evaluated by the appropriate academic unit. Essential Duties  Prepare and deliver graduate-level courses in computer science and artificial intelligence based on the course learning outcomes and syllabus  Teach students the concepts of Machine Learning and how it integrates into other disciplines  Develop and deliver lectures, assignments, and assessments that align with course objectives  Provide timely and constructive feedback to students on their assignments and assessments  Advise and mentor students on research projects related to Artificial Intelligence  Stay up to date with the latest developments in AI and incorporate them into the course material  Collaborate with other faculty members to make revisions to the Analytics course in order to maintain relevancy and continue improving it  Graduate level courses typically meet one evening per week for nine weeks. Other Responsibilities The successful candidate will be expected to  Teach courses at the undergraduate and graduate level  Teach day classes, evening, and online classes  Work with adjunct faculty  Assist with curriculum development  Assist the department with the academic program and assessment  Participate in appropriate professional development (Boyer Model)  Maintain competence in the field by staying current with new and emerging theory, applications and teaching approaches  Perform administrative tasks as needed Applicants should forward  (1) a letter of interest which addresses the identified qualifications, (2) an expanded resume or curriculum vitae, and (3) references. Review of applications will begin immediately and will continue until the position is filled. It is anticipated that the successful candidate will assume the position summer or fall 2025 (August). Preferred Qualifications  Candidates must possess a Ph.D. in Computer Science or directly related fields and a specialty in Artificial Intelligence Machine Learning or related fields  Strong communication and presentation skills  A commitment to student success and the ability to motivate and inspire students to learn.  All academic degrees earned in the U.S. shall have been awarded by regionally accredited institutions, and faculty shall provide documentation thereof. For faculty whose degrees are earned abroad, official transcripts must be submitted to and evaluated by the appropriate academic unit. Essential Duties  Prepare and deliver graduate-level courses in computer science and artificial intelligence based on the course learning outcomes and syllabus  Teach students the concepts of Machine Learning and how it integrates into other disciplines  Develop and deliver lectures, assignments, and assessments that align with course objectives  Provide timely and constructive feedback to students on their assignments and assessments  Advise and mentor students on research projects related to Artificial Intelligence  Stay up to date with the latest developments in AI and incorporate them into the course material  Collaborate with other faculty members to make revisions to the Analytics course in order to maintain relevancy and continue improving it  Graduate level courses typically meet one evening per week for nine weeks. Other Responsibilities The successful candidate will be expected to  Teach courses at the undergraduate and graduate level  Teach day classes, evening, and online classes  Work with adjunct faculty  Assist with curriculum development  Assist the department with the academic program and assessment  Participate in appropriate professional development (Boyer Model)  Maintain competence in the field by staying current with new and emerging theory, applications and teaching approaches  Perform administrative tasks as needed Applicants should forward  (1) a letter of interest which addresses the identified qualifications, (2) an expanded resume or curriculum vitae, and (3) references. Review of applications will begin immediately and will continue until the position is filled. It is anticipated that the successful candidate will assume the position summer or fall 2025 (August). Department Computer and Info Sciences-CAIS Special Instructions For Applicant Required Documents 1. Cover Letter-Letter of Interest 2. Curriculum Vitae 3. Transcripts 4. Evidence of Teaching Effectiveness Physical Demands What is involved in teaching students To apply, visit https recruiting.adp.com srccar public RTI.home?r 5001119010406 c 1180715 d ExternalCareerSite rb jobelephant jeid-5cff93c7a6b0944682c2ff2a1450292d"
  },
  {
    "title": "Software Engineering",
    "company": "Microsoft Legal Department",
    "location": "St. Louis",
    "description": "Job Duties Microsoft Corporation has the following job opportunity Responsible for developing or testing computer software applications, systems or services. Evaluate requirements, estimate development costs, design and implement the software, review the design and implementation, improve the development process, perform unit testing, communicate status, analyze risks and compromises, integrate software into a larger system, or diagnose and resolve issues. Work autonomously on specific software feature areas or components, contributing broadly to product development and demonstrating characteristics of emerging technical leadership. May be assigned to various projects that utilize the required technical skills to deploy successful product releases, from early product definition and scoping to detailed specification, implementation and roll-out phases. Telecommuting permitted 50% or more per week within same area as assigned MSFT office location. Minimum Requirements Education  Bachelor s degree or foreign equivalent degree in Computer Science, Software Engineering, Math, IT, Electrical Engineering, or related. Experience  60 months of experience in any computer related occupation. Specific Skills  Education or experience in .NET  .Net Framework  Algorithms  AngularJS  ASP.Net  CI CD  and Distributed Systems. Multiple job openings. Qualified candidates must meet the minimum requirements for the position. Microsoft Corporation is equal opportunity employer. Pay Range and Benefits Information The offered base pay range for this specific position (V3725192f), in St. Louis, MO, is $133,973 to $163,973 per year. Microsoft has different base pay ranges for different work locations within the United States, which allows us to pay employees competitively and consistently in different geographic markets. Individual base pay depends on various factors, in addition to primary work location, such as complexity and responsibility of role, job duties requirements, and relevant experience and skills. Base pay ranges are reviewed and typically updated each year. Offers are made within the base pay range applicable at the time. At Microsoft certain roles are eligible for additional rewards, including merit increases, annual bonus, and stock. These awards are allocated based on individual performance. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee s role. Benefits perks listed may vary depending on the nature of employment with Microsoft and the country work location. U.S.-based employees have access to medical, dental, and vision insurance, a 401(k) plan and company match, short-term and long-term disability coverage, basic life insurance, and wellbeing benefits, among others. U.S.-based employees also receive, per calendar year, up to 10 scheduled paid holidays, and up to 80 hours Holistic Health Time Off. Additionally, hourly non-exempt employees accrue up to 120 hours paid vacation time, and salaried exempt employees have Discretionary Time Off (DTO). Full time employment  multiple positions open. Employment Type  OTHER"
  },
  {
    "title": "Information Technology Engineer (Computing Methods & Technology)",
    "company": "Boeing",
    "location": "Hazelwood",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We re committed to fostering an environment for every teammate that s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. At Boeing, we are all innovators on a mission to connect, protect, explore and inspire. From the seabed to outer space, you will learn and grow  contributing to work that shapes the world. Find your future with us. The Boeing Global Services (BGS) Government Vehicle Health Management Systems (GVHMS) Team is currently looking for an experienced information technology engineer to join our team in Hazelwood, MO. Our amazing team of engineers develops, fields, and supports platform health management systems for the F A-18, MQ-25, F-15, T-38, T-7, and proprietary platforms. Our software acquires and manages platform health and usage data, performs health, and usage assessment and recommends maintenance actions. We are tasked with the creation, design, development, modification, proof of concept, verification, testing, and demonstration of products and solutions to maximize platform mission readiness and effectiveness, reduce lifecycle costs, and keep our customers safe. In this role, you will help expand the capabilities of hardware infrastructure for applications and products developed within GVHMS. The team is looking for a highly motivated and experienced engineer to work within our hardware team to integrate our software products onto fleet represented server environments. This position will be responsible for updating and maintaining hardware assets (both server and client environments) to support software development, software validation testing, and production deployment of our GVHMS products. Position Responsibilities  Deploy updates to development, test and production environments as required to represent the customer s environment  Migrate data from one asset environment to another  Manage and document the configuration of computing systems  Troubleshoot environment issues during software installations and server upgrades  Assist in managing the hardware inventory of the organization including Government Furnished Equipment (GFE)  Assist in maintaining DFARS compliance documentation (NIST-800, Access Control Policy (ACP), Lab System Security Plan (SSP), and Application Server Recovery Plan) for hardware assets  Analyze, design, and configure networks  Design next generation infrastructure for software developers and systems engineers  Design and document processes for maintaining environments  Test systems and software as necessary to ensure proper operations  Verification Validation support for infrastructure deployments We work in a casual but professional environment with multi-disciplined teams of engineers that take pride in developing, integrating, testing and delivering innovative solutions. There is long-term potential for career growth into technical leadership or management positions and we value the curiosity, tenacity and imagination our engineers bring to our teams each day. To be considered for this position you will be required to complete a technical assessment as part of the selection process. Failure to complete the assessment will remove you from consideration. Basic Qualifications (Required Skills  Experience)  Bachelor of Science degree from an accredited course of study in engineering, engineering technology (includes manufacturing engineering technology), chemistry, physics, mathematics, data science, or computer science  2  years SQL Database administration experience  1  years of experience with Linux and Windows operating systems  1  PostgreSQL Preferred Qualifications (Desired Skills Experience)  Oracle Database Administrator   Oracle System Administrator  PL SQL (Procedural Language extensions to the Structured Query Language)  Data Modeling and Design  Familiarity with DFARS compliance requirements Drug Free Workplace Boeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies. At Boeing, we strive to deliver a Total Rewards package that will attract, engage and retain the top talent. Elements of the Total Rewards package include competitive base pay and variable compensation opportunities. The Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work. The specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements. Pay is based upon candidate experience and qualifications, as well as market and business considerations. Summary pay range for Experienced  $73,100.00 - $98,900.00 Applications for this position will be accepted until Jul. 02, 2025 Export Control Requirements  This position must meet export control compliance requirements. To meet export control compliance requirements, a  U.S. Person  as defined by 22 C.F.R.  120.15 is required.  U.S. Person  includes U.S. Citizen, lawful permanent resident, refugee, or asylee. Export Control Details  US based job, US Person required Relocation This position offers relocation based on candidate eligibility. Security Clearance This position requires the ability to obtain a U.S. Security Clearance for which the U.S. Government requires U.S. Citizenship. An interim U.S. Secret Clearance Pre-Start and final U.S. Secret Clearance Post-Start is required. Visa Sponsorship Employer will not sponsor applicants for employment visa status. Shift This position is for 1st shift Equal Opportunity Employer Boeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military veteran status or other characteristics protected by law."
  },
  {
    "title": "Senior Electrical Engineering & Computer Science Associate",
    "company": "BCG Attorney Search",
    "location": "St. Louis",
    "description": "Job Overview A leading law firm is seeking an experienced Senior Associate to join its Electrical Engineering and Computer Science Patent Prosecution Practice Group. The ideal candidate should have a strong academic background, solid law firm experience, and excellent writing and communication skills. This position will focus on managing patent preparation and prosecution for clients in the electrical engineering and software technologies fields. Location  St. Louis, MO Duties  Drafting and filing high-quality patent applications.  Overseeing patent prosecution for electrical engineering and software technologies.  Ensuring the accuracy and timeliness of patent filings.  Supervising and mentoring junior associates.  Drafting and prosecuting patents for advanced technologies such as GPUs, TPUs, accelerators, neural engines, and robotics. Requirements  At least six years of experience in patent preparation and prosecution.  A degree in electrical engineering, computer engineering, software engineering, computer science, or physics.  Expertise in drafting and prosecuting patent applications for complex technologies.  Strong understanding of patent laws and USPTO procedures.  Ability to work independently and collaborate with a team. Education  JD from an accredited law school.  Undergraduate (and graduate, if applicable) degree in electrical engineering, computer science, or a related field. Certifications  Active bar admission in the jurisdiction where the candidate intends to practice.  Admission to the USPTO required. Skills  Strong written and verbal communication skills.  Analytical and problem-solving skills.  Proven ability to manage and prosecute patent applications.  Ability to supervise and mentor junior associates.  Knowledge of intellectual property and patent law. Benefits  Discretionary bonus based on performance.  Medical, dental, life, and disability insurance coverage.  Voluntary vision insurance options.  401(k) retirement plan.  Paid time off. Ranked as one of the Best Client Relationships firm and as one of the top Best Known Firms in the nation, the attorneys in this firm are invested in understanding their clients? businesses from all angels, including the risks, challenges, and issues affecting their industries. This AmLaw 100 firm values diversity and inclusion. Attorneys strive to build true partnerships with the firm?s clients. The firm invests in its associates by providing opportunities for professional development based on each person?s desired career path. The goal is to give each individual the opportunity to achieve their best and take pride in their performance and quality of work. Compensation at this firm is competitive with peer firms in the region. SKILLS - IP - Patent - Hard Sciences,Intellectual Property - General,Patent Agents - Hard Science General"
  },
  {
    "title": "Adjunct Instructor Computer Science",
    "company": "Saint Louis University",
    "location": "St. Louis",
    "description": "Job Type  Part time Job Number  2022-06071 Location  SLU Saint Louis, MO Who is Saint Louis University? Founded in 1818, Saint Louis University is one of the nation s oldest and most prestigious Catholic universities. SLU, which also has a campus in Madrid, Spain, is recognized for world-class academics, life-changing research, compassionate health care, and a strong commitment to faith and service. All About You The Department of Computer Science in the School of Science and Engineering at Saint Louis University is seeking part-time adjunct faculty on an on-going basis to teach undergraduate and graduate courses in computer science. Qualified applicants will be reviewed and placed in a pool to be contacted as openings become available. To teach at the undergraduate level, faculty must hold a degree in computer science or equivalent industry experience relevant to the subject of the course. To teach at the graduate level, faculty should hold an MS or PhD in computer science or a closely related field, or a Bachelor s degree in CS or a related field combined with at least 5 years of relevant professional experience. For a list of possible classes that we offer, please see https cs.slu.edu academics courses The Computer Science Department is a fast-growing unit that offers a range of undergraduate and graduate degrees in Computer Science, Software Engineering, and Artificial Intelligence, as well as supporting joint programs in Data Science and in Bioinformatics and Computational Biology. Our department faculty are renowned scholars and educators who help design, lead, and support these programs. They design and deliver the educational experience, and are the principal investigators in cutting-edge research. Collectively the faculty serve in leadership positions at professional organizations, publish and present their work in the top national and international venues, have created and presented innovative educational techniques, and have authored textbooks used by hundreds of institutions worldwide. Saint Louis University is a Catholic, Jesuit institution dedicated to student learning, research, healthcare, and service. The newly formed School of Science and Engineering, founded in 2022, is interdisciplinary by design - bringing together our engineering departments (Aerospace and Mechanical, Biomedical, Civil, and Electrical and Computer Engineering) with our Aviation, Computer Science, Chemistry, Physics, and Earth and Atmospheric Sciences departments. The School offers a wide range of graduate and undergraduate degrees, and our faculty hold funding from sources such as the National Science Foundation, National Institutes of Health, the Alfred P. Sloan Foundation, Siemens, and the Missouri and Illinois Departments of Transportation. Vaccine Protocol Saint Louis University requires COVID-19 vaccinations for all students, staff, and faculty who are physically present on our St. Louis campuses. As a prospective and or a new employee at Saint Louis University, you will be are required to comply with the University s vaccination protocol. Proof of full vaccination is required before the start of employment in order to work at Saint Louis University. If you are not vaccinated, you are required to begin the vaccination process at the time of your first day of employment and submit proof of full vaccination within 30 days of your start date. Exemptions may be granted on the grounds of religious beliefs or medical circumstances. Failure to comply with the vaccine requirement within 30 days of an employee s start date will result in termination of the employment. Proof of vaccine will be submitted through an online portal made available to you during your Workday onboarding tasks. Function Faculty - Adjunct Scheduled Weekly Hours 10 Saint Louis University is an equal opportunity affirmative action employer. All qualified candidates will receive consideration for the position applied for without regard to race, color, religion, sex, age, national origin, disability, marital status, sexual orientation, military veteran status, gender identity, or other non-merit factors. We welcome and encourage applications from minorities, women, protected veterans, and individuals with disabilities (including disabled veterans). If accommodations are needed for completing the application and or with the interviewing process, please contact Human Resources at 314-977-5847."
  },
  {
    "title": "St. Louis High School Computer Science Tutor",
    "company": "Varsity Tutors, a Nerdy Company",
    "location": "St. Louis",
    "description": "The Varsity Tutors Live Learning Platform has thousands of students looking for online High School Computer Science tutors nationally and in St. Louis. As a tutor on the Varsity Tutors Platform, you ll have the flexibility to set your own schedule, earn competitive rates, and make a real impact on students  learning journeys all from the comfort of your home. Why Join Our Platform?  Base contract rates start at $18 hour and increase for specialized subjects. Plus, you ll earn incrementally higher pay for each session with the same student reaching up to $40 hour.  Get paid up to twice per week, ensuring fast and reliable compensation for the tutoring sessions you conduct and invoice.  Set your own hours and tutor as much as you d like.  Tutor remotely using our purpose-built Live Learning Platform no commuting required.  Get matched with students best-suited to your teaching style and expertise.  Our AI-powered Tutor Copilot enhances your sessions with real-time instructional support, lesson generation, and engagement features helping you save prep time and focus on impactful teaching.  We handle the logistics you just invoice for your tutoring sessions, and we take care of payments. What We Look For In a Tutor  Strong communication skills and a friendly, engaging teaching style.  Expertise in High School Computer Science and the ability to explain concepts clearly.  Ability to personalize lessons and adapt to different learning styles.  Priority given to those with tutoring experience, teaching experience, and graduate-level education. Ways To Connect With Students  1-on-1 Online Tutoring - Provide personalized instruction to individual students.  Instant Tutoring - Accept on-demand tutoring requests whenever you re available. About Varsity Tutors And 1-on-1 Online Tutoring Our mission is to transform the way people learn by leveraging advanced technology, AI, and the latest in learning science to create personalized learning experiences. Through 1-on-1 Online Tutoring, students receive customized instruction that helps them achieve their learning goals. Our platform is designed to match students with the right tutors, fostering better outcomes and a passion for learning. Please note  Varsity Tutors does not currently contract with tutors in  Alaska, California, Colorado, Delaware, Hawaii, Maine, New Hampshire, North Dakota, Vermont, West Virginia, or Puerto Rico. Please note  Varsity Tutors does not contract in  Alaska, California, Delaware, Hawaii, Maine, New Hampshire, North Dakota, Vermont, West Virginia or Puerto Rico."
  },
  {
    "title": "St Louis Ap Computer Science Tutor",
    "company": "BuffTutor Network",
    "location": "St. Louis",
    "description": "St Louis Ap Computer Science Tutor BuffTutor is a network of experienced and passionate tutors who provide academic assistance to college   high school students. We are always hiring dedicated tutors  if you love teaching, join us! Responsibilities  Provide 1-on-1 in-person or online tutoring to university and or high school students. We are primarily hiring STEM tutors to assist with courses such as Math, Calculus, Physics, Chemistry, Biology, Economics etc. BENEFITS  Set your own rate.  In-person   online tutoring available  meet wherever works for you.  Set your own schedule  meet whenever works for you.  Work with as many (or as few) students as you would like to. QUALIFICATIONS  Have at least a 3.0 or better major GPA (out of 4.0).  Have earned a B or better in the courses you wish to tutor.  Have at least one year (or two semesters) of experience as a tutor, teacher, teaching learning assistant or instructor.  Have excellent communication skills and you must be fluent in the language that you teach in. Foreign Language tutors must be fluent in the Foreign Language they wish to tutor. ABOUT BUFFTUTOR BuffTutor is dedicated to connecting students with intelligent and experienced tutors. We primarily focus on university level tutoring, but also work with high school and middle school students. More than just another tutor list, we prioritize the academic needs of our students while also treating our tutors with dignity and respect  We have some of the strictest eligibility criteria and challenging proficiency exams. Only the best can join our network!  Tutors can set their own schedule. Our motto is quality is more important than quantity. Take on one student but be the best tutor for that student!  Tutors can set their own rate. Earn what you are worth!  We review student evaluations to help us keep the best tutor in our network. BuffTutor was founded in 2009 and since then we have helped thousands of students and parents connect with affordable and passionate educators! Please note that tutors are independent contractors, not employees. All applicants must already have work permissions  applicants who are students must be able to work an off-campus position. We do not sponsor individuals and we cannot work with F-1 or J-1 international students"
  },
  {
    "title": "Student Worker - Computer & Information Technology Dept",
    "company": "St. Louis Community College",
    "location": "St. Louis",
    "description": "Job no  496282 Work type  Part-time, Student Location  Forest Park Campus Categories  Information Technology Title  Student Worker - Computer   Information Technology Dept Employee Classification  Student Worker Department  Academic Data Center Salary Range  $15.00 per hour Who we are We are not-for-profit  St. Louis Community college (STLCC) is a non-profit institution dedicated to empowering students, expanding minds, and changing lives. Employees are committed to strengthening the St. Louis community with inclusive and transformative education. We are a respected employer  For 60 years, STLCC has served the St. Louis community, expanding to 4 main campuses, 2 education centers, 2 workforce training centers, and 5 centers of excellence. More than one-half of the households in St. Louis have at least one member who has taken classes at STLCC. We make an impact in the community  Through credit courses, continuing education, and workforce development programs, STLCC annually serves nearly 69,000 students. More than 80% of career and technical graduates employed in their fields or continue their education at four-year institutions within six months of graduation. STLCC sends more transfer students to Missouri s four-year colleges universities than anyone else. What you get Benefits package  for full-time employees  STLCC offers one of the best benefit packages in the St. Louis area. As a STLCC employee you will have access to a 100% match on your contribution to retirement, two health insurance plans options that are no cost to the employee - including an HSA option, low-cost life insurance with a 3x salary benefit, and other low-cost benefits including dental, vision, AD D, Short-term   Long-term disability insurance. Opportunity to grow  Over half of our employees have served the college for more than 12 years, exploring different career paths and advancing to higher level positions. Education   training opportunities  STLCC offers tuition waivers for employees  full-time and part-time    their dependents. Full-time employees can take advantage of tuition reimbursement for other institutions after just 6 months of service, and an annual professional development allotment. Work life balance  Full-time STLCC employees have access to a generous time off package, including holidays, vacation, personal days, medical leave, and other leave options. Our holiday schedule even includes a paid winter holiday at the end of the calendar year. Commitment to wellness  STLCC HR boasts a dedicated health and wellness specialist who is enthusiastic about creating a culture of wellness throughout the College. With access to college wellness vendors, employees are educated, motivated, and rewarded for healthy behaviors. STLCC employees and anyone living in their household also have access to an employee assistance program (EAP) that can help them with virtually any life need. The basics of this position Student workers will gain essential entry-level IT skills in networking, cybersecurity, software development, and or help desk support. They will learn to support various technologies including PCs, scanners, and printers and software such as word processing, spreadsheets, databases, Internet tools, Canvas, Banner-Web, and introductory programming languages. Working in the E307 Computer Center and Computer   Information Technology (CIT) Department technology centers, they will perform routine maintenance, manage housekeeping tasks, and complete additional assignments as directed by the E307 shift supervisors and department chair of the CIT department. What you ll do Education, experience, and other requirements Must be a registered St. Louis Community College student prior to applying for a student worker position. Must maintain student status during employment. Also, will maintain a 2.0 grade point average while employed as an STLCC student worker.  General knowledge of Windows operating systems  Internet browsers, the Microsoft Office Suite and Blackboard Banner. Preferred Qualifications Completion of nine Information Systems (or computer-intensive) credit hours  GPA of 3.0 and up, but will consider 2.5 GPA and up  declared major in Information, Computer Science or technology program  and exceptional customer service skills. Applications close"
  },
  {
    "title": "Part-time Faculty: Computer Science/Information Technology - 74648",
    "company": "St. Charles Community College",
    "location": "Cottleville",
    "description": "St. Charles Community College is located just west of St. Louis, in the heart of growing St. Charles County. At St. Charles Community College, we have a passion for student success. We serve a growing diverse student population, and we are committed to increasing the diversity of our faculty and staff who will help prepare our students for a global society. Qualified candidates will have demonstrated success in serving diverse student populations. SCC invites qualified candidates to apply for our part-time pooled faculty position to teach Information Technology courses the Spring 2025 semester. Part-time appointments made on a semester-by-semester (as needed) basis. The part-time positions focus on equipping current and future IT workers with relevant skills. MINIMUM QUALIFICATIONS  Experience in IT field or any of the following areas  System administration for Windows and or Linux desktops and servers, Cisco routing and switching, VMware virtualization, cyber security. PREFERRED QUALIFICATIONS  Bachelor s degree or higher (prefer degree in related field)  Prior teaching or training experience  Various IT certifications. To apply  Please attach cover letter, resume cv, and copies of your transcripts and or certifications. Applicants are encouraged to reference about classes at www.stchas.edu it St. Charles Community College is an Equal Opportunity Employer."
  },
  {
    "title": "Computer Science",
    "company": "KIPP DC",
    "location": "St. Louis",
    "description": "Company Overview KIPP St. Louis is part of a national network of free, open-enrollment public charter schools offering a choice to families and children in St. Louis city. As the largest charter school system in the city, we are driven and committed to our mission, vision, and equity statement. Mission  Together with families and communities, we create joyful, academically excellent schools that prepare students with the skills and confidence to pursue their chosen paths college, career, and beyond. Vision  Every child grows up free to create the future they want for themselves and their communities. Equity Statement  KIPP St. Louis is committed to becoming an anti-racist and anti-sexist organization by confronting inequities, barriers, and oppressive policies and systems. We currently educate over 2,000 students and aim to educate nearly 3,600 students and hundreds of alumni at full growth. Job Description As the Computer Science   Coding Teacher, you have a passion for teaching students about computers and basic computer programming. Position Type  Full-time, Exempt, 10-Month Responsibilities Curriculum Development and Instruction  Adapt and execute a rigorous, standards-aligned curriculum.  Develop academically rigorous lessons, unit plans, rubrics, and assessments.  Use data to inform instructional decisions.  Provide daily feedback on student performance and plan for individual learning needs. Help Build a Positive School and Classroom Culture  Embody and maintain the school s values, policies, and culture.  Develop positive relationships with students, families, teachers, and staff.  Establish and maintain strong communication with parents and share progress.  Effectively supervise and manage a classroom of up to 30 students.  Attend critical school events, including staff meetings, open houses, parent-teacher conferences, and more. Demonstrate a Growth Mindset  Pursue challenging professional goals each year.  Give and receive positive and constructive feedback from colleagues.  Participate in school-wide and individual professional development. Requirements  Valid Missouri Teacher Certification or willingness to become certified ASAP.  Bachelor s degree (REQUIRED).  Pass a criminal background check.  Demonstrated commitment to closing the opportunity gap. Benefits  $0 deductible healthcare plan option.  Employer-Paid Short-Term Disability.  $50,000 life insurance policy at no cost to the employee.  Retirement plan through PSRSSL with a 13% match and an optional 403b supplement.  Employee Recognition  Celebrate achievements together.  Public Service student loan forgiveness program qualified employer.  Longevity Bonuses  Financial rewards at 2, 5, and 10 years.  Generous time off, paid parental leave, holidays, and breaks.  On-going professional development opportunities. At KIPP St. Louis, we are committed to creating a diverse, equitable, and inclusive environment for all our students, families, teachers, staff, and community members."
  },
  {
    "title": "Part-time Faculty: Computer Science/Information Technology",
    "company": "St. Charles Community College",
    "location": "Cottleville",
    "description": "St. Charles Community College is located just west of St. Louis, in the heart of growing St. Charles County. At St. Charles Community College, we have a passion for student success. We serve a growing diverse student population, and we are committed to increasing the diversity of our faculty and staff who will help prepare our students for a global society. Qualified candidates will have demonstrated success in serving diverse student populations. SCC invites qualified candidates to apply for our part-time pooled faculty position to teach Information Technology courses the Spring 2025 semester. Part-time appointments made on a semester-by-semester (as needed) basis. The part-time positions focus on equipping current and future IT workers with relevant skills. MINIMUM QUALIFICATIONS  Experience in IT field or any of the following areas  System administration for Windows and or Linux desktops and servers, Cisco routing and switching, VMware virtualization, cyber security. PREFERRED QUALIFICATIONS  Bachelor s degree or higher (prefer degree in related field)  Prior teaching or training experience  Various IT certifications. To apply  Please attach cover letter, resume cv, and copies of your transcripts and or certifications. Applicants are encouraged to reference about classes at www.stchas.edu it St. Charles Community College is an Equal Opportunity Employer."
  },
  {
    "title": "Computer Science Co-Op",
    "company": "Hunter Engineering",
    "location": "Bridgeton",
    "description": "About the position Hunter Engineering Company is seeking a Computer Science Co-Op for its headquarters in Bridgeton, Missouri. This position is designed for students majoring in Computer Science or Computer Engineering who have a passion for Linux operating systems and systems hardware. As a family-owned business since 1946, Hunter Engineering has established itself as a global leader in wheel alignment systems, wheel balancing systems, and vehicle inspection systems, with its equipment being utilized by vehicle manufacturers, tire companies, and dealers in over 130 countries. The company has been recognized as a finalist for the Best Places to Work award by the St. Louis Business Journal in 2024. The Computer Science Co-Op will be primarily responsible for the research and development of various Linux OS features and system hardware. This role involves working closely with R D engineers on a variety of projects, including the customization of Linux OS, testing and evaluation of system motherboards, and researching ARM single-board computers. The Co-Op position offers a structured onsite schedule of 40 hours per week, with a start date in early January 2025 and an end date in late August 2025. The individual in this role will engage in tasks such as customizing Linux OS for compatibility with UEFI, evaluating printer systems, researching operating system security technologies, and documenting findings. Additionally, the Co-Op will utilize source control tools like TFS to manage documentation and software projects, ensuring that frequently used processes are well-documented for others to replicate. This position provides an excellent opportunity for students to gain real-world experience and contribute to innovative projects within a supportive and collaborative environment. Responsibilities  Customization of Linux OS, packages, components, and features. ,  Customization of Linux OS for compatibility with UEFI. ,  Test and evaluation of system motherboards and components. ,  Research ARM single-board computers. ,  Research IPP Everywhere printing. ,  Customization of printing packages. ,  Test and evaluation of printer systems. ,  Research operating system security technologies. ,  Document findings and outcomes. ,  Work with source control tools like TFS to record documentation and software projects. ,  Document frequently used processes for others to duplicate. ,  Software design and testing. Requirements  Major study in Computer Science or Computer Engineering. ,  Minimum 3.0 GPA (must be on resume). ,  Experience with Bash scripting or Python programming. ,  Experience with embedded computing systems (Raspberry Pi, Tinkerboard 2S). ,  Experience with build tools (Make, CMake, or Ninja). ,  Excellent communication skills. Nice-to-haves Benefits  Real-world experience ,  Off-campus team bonding appreciation event ,  Lunch and Learns with full-time employees and company executives ,  Free Onsite Fitness   Recreation Center"
  },
  {
    "title": "Computer Science Instructor (FA25-055)",
    "company": "Southern Illinois University Edwardsville (SIUE)",
    "location": "Edwardsville",
    "description": "Faculty Position FA25-055 June 10 2025 Position TitleInstructor of Computer Science for AY2025-2026 Hiring Unit School of Engineering Job Description Responsibilities The Department of Computer Science in the School of Engineering is seeking to fill a full-time, non-tenure track instructor position beginning Fall semester of 2025 (AY 2025-2026). The instructor will have a 4 4 course load with various teaching assignments of courses at the undergraduate level, including, but not exclusive to, introductory programming courses, web development, software engineering, and capstone projects. For more information regarding the Computer Science Department, please visit  https www.siue.edu engineering computer-science Minimum Qualifications M.S. in Computer Science, or related field, is required. Professional experience is preferred. Prior teaching experience is preferred, but not required. Southern Illinois University Edwardsville nurtures an open, respectful, and welcoming climate that facilitates learning and work. SIUE is committed to education that explores the historic significance of diversity in order to understand the present and to better enable our community to engage the future. Integral to this commitment, Southern Illinois University Edwardsville strives for a student body and a workforce that is both diverse and inclusive. We strongly encourage candidates from historically underrepresented groups, including women, members of racially minoritized groups, and individuals with disabilities, to apply. For more on our State of Diversity, visit SIUE Mission, Goals and Plans at About - Statement on Diversity   SIUE. Terms of Appointment Nine-month academic term appointment (non-tenure track), beginning August 16th 2025. Renewable with future opportunity for advancement. Source of Funds State of Illinois and or Extramural Awards Salary $66,219-$69,704 For more information about employment benefits and policies, visit  Faculty   Staff - Human Resources   SIUE Application Process To be considered for this vacancy, applicants must submit a letter of application, curriculum vitae, transcripts, and three professional references as a single PDF file to cs-instructor-search siue.edu. Application Deadline Application materials will be accepted until position is filled. SIUE is a state university - benefits under state sponsored plans may not be available to holders of F1 or J1 visas. Applicants will be subject to a background check prior to an offer of employment. EEO Statement Southern Illinois University Edwardsville is an equal opportunity employer and thus prohibits discrimination against employees, applicants for employment and students on the basis of age, color, disability, marital status, national origin, race, religion, sex, sexual orientation, or veteran s status. In compliance with the ADA Amendments Acts (ADAAA), if you have a disability and would like to request an accommodation in order to apply for a position with Southern Illinois University Edwardsville, please call 618-650-2190 or email CareerInfo siue.edu. The SIUE Annual Security and Fire Safety Report is available online at https www.siue.edu police cleary-act-forms  . This report is published in compliance the  Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act  and the Higher Education Opportunity Act also known as the  Campus Fire Safety Right to Know. Dual Career Support for New FacultyThe Career Development Center, in partnership with SIUE s Toward an Inclusive Model of Excellence project, is proud to provide a variety of career services and resources to partners of new faculty who have relocated to the Greater St. Louis area. Support for this initiative was provided by the National Science Foundation (NSF) through Award 1936141. This program offers various career services and resources available to help individuals in their career journey. Additional details may be found online at Dual Career Support"
  },
  {
    "title": "Patent Attorney or Agent / Software CS Computer / Remote USA 3571-i",
    "company": "IP Recruiter Group",
    "location": "St. Louis",
    "description": "APPLY DIRECT  mark  at  iprecruiter.org     Work FULLY REMOTELY from ANYWHERE in the USA  This highly regarded IP group has been steadily growing as they continue to attract sophisticated work from an impressive roster of high-tech clients. We are currently looking for a patent attorney with a strong technical background in computer science or computer engineering. This is a very team oriented, friendly, and cooperative environment wherein talent is matched with opportunity and team members are entrusted with substantial client interaction. and must possess excellent interpersonal skills. Opportunity to work fully remotely as a patent attorney from anywhere in the USA. Within this practice there is an abundance of high-quality work from sophisticated clients, yet you will not be expected to do ridiculous hours. More specifically, you have input regarding your target billable hours. This group is more interested in keeping quality talent and providing quality work to clients. This is a competitive compensation structure that rewards production while allowing you be in charge of your work life balance. As a consequence, this firm has a great track record of keeping and growing people and clients. There is an abundance of challenging and sophisticated work here, thus you will be exposed to a diverse array of complex software and computer engineering applications (cryptography, block-chain, artificial intelligence (AI), machine learning (ML), enterprise and mobile applications, databases and data structures, web and cloud services, virtualization, operating systems, file systems. software user interfaces, open source, 3D graphics, digital design, grid computing, computer networking, telecommunications, network protocols, computer architecture, network security, etc.). The focus of the work will primarily relate to the preparation and prosecution of patents for domestic and foreign clients while also supporting practice needs in other related areas (e.g., patentability, infringement, and freedom to operate opinions  portfolio strategy and management  due diligence  litigation support  Patent Trial and Appeal Board issues). Patent Attorney Requirements  Degree in Computer Science, Computer Engineering, Electrical Engineering.  Must have at least 2 years of full-time claim drafting and prosecutions experience.  USPTO Patent Attorney. Note  This opportunity is applicable to junior and substantially experienced attorneys    APPLY DIRECT  mark  at  iprecruiter.org  Relevant Terms  patent attorney, patent agent, law firm, IP, intellectual property, computer science, computer engineering, cryptography, block-chain, software patents, artificial intelligence (AI), machine learning (ML), enterprise and mobile applications, databases and data structures, web and cloud services, virtualized environments, virtualization, operating systems, software user interfaces, open source, 3D graphics, digital design, grid computing, telecommunications, computer networking, network protocols, computer architecture, network security, wireless telecom, network protocols, computer science, CS, BSCS, MSCS, PhD, software engineer, software engineering, USPTO attorney, US patent agent, patent bar, law firm jobs, salaries, salary, pay, compensation, agency, agencies, job, legal search firm, law firm recruiting, recruiter, recruitment, top recruiters, best headhunters, headhunter, list, hiring trends, positions, openings, postings online, opportunities, careers, home office, work from home, fully remote, virtual office, remote work allowed    APPLY DIRECT  mark  at  iprecruiter.org  Notes for Potential Candidates  All fees are paid by client firms and companies. As a consequence of our reputation for having integrity and providing results, we often work on exclusive assignments that are not advertised. We have been successfully building relationships with leaders in the IP community since 1986.  Another important distinction is that we work directly with the decision makers (partners, managing counsels, etc.) that make the determinations regarding who will be interviewed, who will be extended an offer, etc.  You have our express commitment that all information is accepted in confidence and that no resumes are submitted without first speaking to you and obtaining your explicit permission. Additional Notes We are actively recruiting for numerous other opportunities  IP Attorneys, Patent Agents, and Technical Advisors (e.g., electrical, software, chemical, biological, and mechanical)  All levels of experience, inclusive of managing counsels and practice mergers  Corporations and law firms of all sizes  Various locations, literally from coast to coast, including telecommute scenarios If this particular opportunity does not match your background and or interests, please do not hesitate to email me directly  mark  at  iprecruiter.org    APPLY DIRECT  mark  at  iprecruiter.org     Work FULLY REMOTELY from ANYWHERE in the USA  Job Type  Full-time Work Location  In person"
  }
]